slowpoke/hotel/04-04-benchmarking-bus-theory/mix-profile-t8-c512-r1-req20000-n2-batch40000000-flush-then-delay-new-go-version.log
benchmark                        : hotel
num_threads                      : 8
num_conns                        : 512
target_service                   : profile
request_type                     : mix
repetitions                      : 1
target_num_exp                   : 2
pre_run                          : False
num_req                          : 20000
groundtruths                     : []
slowdowns                        : []
predicteds                       : []
errs                             : []
client_cpu_quota                 : 4
random_seed                      : 1234
request_ratio                    : {'frontend': 1, 'profile': 0.8, 'rate': 0.8, 'reservation': 1, 'search': 0.8, 'user': 0.198478617}
baseline_service_processing_time : {'frontend': 0, 'profile': 1000, 'rate': 0, 'reservation': 0, 'search': 0, 'user': 0}
cpu_quota                        : {'frontend': 2, 'profile': 2, 'rate': 2, 'reservation': 2, 'search': 2, 'user': 2}
target_processing_time_range     : [0, 1000]
baseline_throughputs             : []
poker_batch                      : 40000000
[test.py] Starting experiment...
[test.py] >>>>>>>>>>>>>>>>>>>>>>>>>>>>> Running experiment 0...
[test.py] Actual processing time range: [0, 500]
[test.py] Running baseline experiment
    [exp] Running (pre_run: False) workload hotel/mix request with the following configuration: {'CLIENT_CPU_QUOTA': '4', 'SLOWPOKE_POKER_BATCH_THRESHOLD': '40000000', 'SLOWPOKE_PROCESSING_MICROS_FRONTEND': '0', 'SLOWPOKE_PROCESSING_MICROS_PROFILE': '1000', 'SLOWPOKE_PROCESSING_MICROS_RATE': '0', 'SLOWPOKE_PROCESSING_MICROS_RESERVATION': '0', 'SLOWPOKE_PROCESSING_MICROS_SEARCH': '0', 'SLOWPOKE_PROCESSING_MICROS_USER': '0', 'SLOWPOKE_DELAY_MICROS_FRONTEND': '0.0', 'SLOWPOKE_DELAY_MICROS_PROFILE': '0.0', 'SLOWPOKE_DELAY_MICROS_RATE': '0.0', 'SLOWPOKE_DELAY_MICROS_RESERVATION': '0.0', 'SLOWPOKE_DELAY_MICROS_SEARCH': '0.0', 'SLOWPOKE_DELAY_MICROS_USER': '0.0'}
    [exp] Executing cmd `bash run.sh hotel mix 8 512 20000`:
        [run.sh] Running benchmark hotel with request mix, thread 8, conn 512, duration 60
        [run.sh] Deleting all services
        service "frontend" deleted
        deployment.apps "frontend" deleted
        service "profile" deleted
        deployment.apps "profile" deleted
        service "rate" deleted
        deployment.apps "rate" deleted
        service "reservation" deleted
        deployment.apps "reservation" deleted
        service "search" deleted
        deployment.apps "search" deleted
        service "user" deleted
        deployment.apps "user" deleted
        deployment.apps "ubuntu-client" deleted
        [run.sh] Waiting for all pods to be deleted
        [run.sh] Deploying all services
        service/frontend created
        deployment.apps/frontend created
        service/profile created
        deployment.apps/profile created
        service/rate created
        deployment.apps/rate created
        service/reservation created
        deployment.apps/reservation created
        service/search created
        deployment.apps/search created
        service/user created
        deployment.apps/user created
        [run.sh] Client pod not found, deploying client
        deployment.apps/ubuntu-client created
        [run.sh] Waiting for all pods to be running
        [run.sh] All pods are running
        [run.sh] Checking heartbeat for all services
        [run.sh] frontend-5d7fd9cd56-trz7v cannot connect to user
        [run.sh] All pods can connect to all services
        [run.sh] Copying hotel/analysis.txt to ubuntu-client-76886f6bbd-bbmp5:/analysis.txt
        [run.sh] Finished populating hotel
        [run.sh] Starting the rust proxy first for hotel
        2025-04-04T13:55:53.736601Z  INFO proxy::hotel: Reading analysis data from /analysis.txt
        [run.sh] Running warmup test
        [run.sh] /wrk/wrk -t8 -c512 -d3s -L http://localhost:3000
        Running 3s test @ http://localhost:3000
        8 threads and 512 connections
        Thread Stats   Avg      Stdev     Max   +/- Stdev
        Latency   277.04ms  114.80ms 745.97ms   69.37%
        Req/Sec   200.76     70.18   400.00     70.82%
        Latency Distribution
        50%  272.69ms
        75%  348.41ms
        90%  422.01ms
        99%  580.48ms
        4692 requests in 3.03s, 357.40KB read
        Requests/sec:   1548.27
        Transfer/sec:    117.93KB
        [run.sh] Speed is 1548.27, duration is 19
        [run.sh] Fix the request number.
        [run.sh] Running the actual test
        [run.sh] /wrk/wrk --timeout 20s -t8 -c512 -d19s -s /wrk/fix_req_n.lua -L http://localhost:3000
        Running 19s test @ http://localhost:3000
        8 threads and 512 connections
        Thread Stats   Avg      Stdev     Max   +/- Stdev
        Latency   285.89ms  109.98ms   1.11s    70.17%
        Req/Sec   222.18     54.00   380.00     70.49%
        Latency Distribution
        50%  279.05ms
        75%  354.41ms
        90%  425.83ms
        99%  580.08ms
        20000 requests in 19.00s, 1.49MB read
        Requests/sec:   1052.62
        Transfer/sec:     80.18KB
        ------------------------------
        stop time: 11.206860
        stop time: 11.360015
        stop time: 11.370363
        stop time: 11.426374
        stop time: 11.459151
        stop time: 11.179530
        stop time: 11.383340
        stop time: 11.297279
        [run.sh] Checking the resource usage
        NAME                             CPU(cores)   MEMORY(bytes)
        frontend-5d7fd9cd56-trz7v        610m         48Mi
        profile-5856cd6487-s54s5         753m         333Mi
        rate-5b9757cd6d-d7zp4            169m         168Mi
        reservation-7888856755-56pgr     152m         174Mi
        search-79d747946c-pshfk          333m         78Mi
        ubuntu-client-76886f6bbd-bbmp5   281m         39Mi
        user-7bc55bfc7f-sfb46            42m          8Mi
        [run.sh] Test finished with status 0
        > STDERR
        > No resources found in default namespace.
        > command terminated with exit code 1
    [exp] Times: [11.20686, 11.360015, 11.370363, 11.426374, 11.459151, 11.17953, 11.38334, 11.297279]
    [exp] Throughput: 1764.3897452256492
[test.py] Baseline throughput: 1764.3897452256492
[test.py] Running groundtruth experiment
    [exp] Running (pre_run: False) workload hotel/mix request with the following configuration: {'CLIENT_CPU_QUOTA': '4', 'SLOWPOKE_POKER_BATCH_THRESHOLD': '40000000', 'SLOWPOKE_PROCESSING_MICROS_FRONTEND': '0', 'SLOWPOKE_PROCESSING_MICROS_PROFILE': '0', 'SLOWPOKE_PROCESSING_MICROS_RATE': '0', 'SLOWPOKE_PROCESSING_MICROS_RESERVATION': '0', 'SLOWPOKE_PROCESSING_MICROS_SEARCH': '0', 'SLOWPOKE_PROCESSING_MICROS_USER': '0', 'SLOWPOKE_DELAY_MICROS_FRONTEND': '0.0', 'SLOWPOKE_DELAY_MICROS_PROFILE': '0.0', 'SLOWPOKE_DELAY_MICROS_RATE': '0.0', 'SLOWPOKE_DELAY_MICROS_RESERVATION': '0.0', 'SLOWPOKE_DELAY_MICROS_SEARCH': '0.0', 'SLOWPOKE_DELAY_MICROS_USER': '0.0'}
    [exp] Executing cmd `bash run.sh hotel mix 8 512 20000`:
        [run.sh] Running benchmark hotel with request mix, thread 8, conn 512, duration 60
        [run.sh] Deleting all services
        service "frontend" deleted
        deployment.apps "frontend" deleted
        service "profile" deleted
        deployment.apps "profile" deleted
        service "rate" deleted
        deployment.apps "rate" deleted
        service "reservation" deleted
        deployment.apps "reservation" deleted
        service "search" deleted
        deployment.apps "search" deleted
        service "user" deleted
        deployment.apps "user" deleted
        deployment.apps "ubuntu-client" deleted
        [run.sh] Waiting for all pods to be deleted
        [run.sh] Deploying all services
        service/frontend created
        deployment.apps/frontend created
        service/profile created
        deployment.apps/profile created
        service/rate created
        deployment.apps/rate created
        service/reservation created
        deployment.apps/reservation created
        service/search created
        deployment.apps/search created
        service/user created
        deployment.apps/user created
        [run.sh] Client pod not found, deploying client
        deployment.apps/ubuntu-client created
        [run.sh] Waiting for all pods to be running
        [run.sh] All pods are running
        [run.sh] Checking heartbeat for all services
        [run.sh] All pods can connect to all services
        [run.sh] Copying hotel/analysis.txt to ubuntu-client-76886f6bbd-nqwr4:/analysis.txt
        [run.sh] Finished populating hotel
        [run.sh] Starting the rust proxy first for hotel
        2025-04-04T13:57:26.398788Z  INFO proxy::hotel: Reading analysis data from /analysis.txt
        [run.sh] Running warmup test
        [run.sh] /wrk/wrk -t8 -c512 -d3s -L http://localhost:3000
        Running 3s test @ http://localhost:3000
        8 threads and 512 connections
        Thread Stats   Avg      Stdev     Max   +/- Stdev
        Latency   262.79ms  103.55ms 739.94ms   70.20%
        Req/Sec   215.35     69.16   400.00     74.14%
        Latency Distribution
        50%  252.32ms
        75%  322.93ms
        90%  399.21ms
        99%  553.86ms
        5011 requests in 3.02s, 381.70KB read
        Requests/sec:   1658.93
        Transfer/sec:    126.36KB
        [run.sh] Speed is 1658.93, duration is 18
        [run.sh] Fix the request number.
        [run.sh] Running the actual test
        [run.sh] /wrk/wrk --timeout 20s -t8 -c512 -d18s -s /wrk/fix_req_n.lua -L http://localhost:3000
        Running 18s test @ http://localhost:3000
        8 threads and 512 connections
        Thread Stats   Avg      Stdev     Max   +/- Stdev
        Latency   279.79ms  108.03ms 862.58ms   68.90%
        Req/Sec   224.30     58.18   454.00     71.36%
        Latency Distribution
        50%  272.97ms
        75%  347.40ms
        90%  420.48ms
        99%  566.65ms
        20000 requests in 18.00s, 1.49MB read
        Requests/sec:   1111.10
        Transfer/sec:     84.63KB
        ------------------------------
        stop time: 11.008046
        stop time: 11.135432
        stop time: 11.106844
        stop time: 11.312779
        stop time: 11.198556
        stop time: 11.201818
        stop time: 11.458756
        stop time: 11.424947
        [run.sh] Checking the resource usage
        NAME                             CPU(cores)   MEMORY(bytes)
        frontend-5d7fd9cd56-9rhlb        0m           42Mi
        profile-65748f6c76-268qz         1m           318Mi
        rate-5b9757cd6d-nqzs9            1m           135Mi
        reservation-7888856755-r55rv     1m           143Mi
        search-79d747946c-5qgnq          3m           179Mi
        ubuntu-client-76886f6bbd-nqwr4   2m           40Mi
        user-7bc55bfc7f-9l7rm            3m           8Mi
        [run.sh] Test finished with status 0
        > STDERR
        > No resources found in default namespace.
    [exp] Times: [11.008046, 11.135432, 11.106844, 11.312779, 11.198556, 11.201818, 11.458756, 11.424947]
    [exp] Throughput: 1780.801618499359
    [exp] Running (pre_run: False) workload hotel/mix request with the following configuration: {'CLIENT_CPU_QUOTA': '4', 'SLOWPOKE_POKER_BATCH_THRESHOLD': '40000000', 'SLOWPOKE_PROCESSING_MICROS_FRONTEND': '0', 'SLOWPOKE_PROCESSING_MICROS_PROFILE': '500', 'SLOWPOKE_PROCESSING_MICROS_RATE': '0', 'SLOWPOKE_PROCESSING_MICROS_RESERVATION': '0', 'SLOWPOKE_PROCESSING_MICROS_SEARCH': '0', 'SLOWPOKE_PROCESSING_MICROS_USER': '0', 'SLOWPOKE_DELAY_MICROS_FRONTEND': '0.0', 'SLOWPOKE_DELAY_MICROS_PROFILE': '0.0', 'SLOWPOKE_DELAY_MICROS_RATE': '0.0', 'SLOWPOKE_DELAY_MICROS_RESERVATION': '0.0', 'SLOWPOKE_DELAY_MICROS_SEARCH': '0.0', 'SLOWPOKE_DELAY_MICROS_USER': '0.0'}
    [exp] Executing cmd `bash run.sh hotel mix 8 512 20000`:
        [run.sh] Running benchmark hotel with request mix, thread 8, conn 512, duration 60
        [run.sh] Deleting all services
        service "frontend" deleted
        deployment.apps "frontend" deleted
        service "profile" deleted
        deployment.apps "profile" deleted
        service "rate" deleted
        deployment.apps "rate" deleted
        service "reservation" deleted
        deployment.apps "reservation" deleted
        service "search" deleted
        deployment.apps "search" deleted
        service "user" deleted
        deployment.apps "user" deleted
        deployment.apps "ubuntu-client" deleted
        [run.sh] Waiting for all pods to be deleted
        [run.sh] Deploying all services
        service/frontend created
        deployment.apps/frontend created
        service/profile created
        deployment.apps/profile created
        service/rate created
        deployment.apps/rate created
        service/reservation created
        deployment.apps/reservation created
        service/search created
        deployment.apps/search created
        service/user created
        deployment.apps/user created
        [run.sh] Client pod not found, deploying client
        deployment.apps/ubuntu-client created
        [run.sh] Waiting for all pods to be running
        [run.sh] All pods are running
        [run.sh] Checking heartbeat for all services
        [run.sh] All pods can connect to all services
        [run.sh] Copying hotel/analysis.txt to ubuntu-client-76886f6bbd-zdqd4:/analysis.txt
        [run.sh] Finished populating hotel
        [run.sh] Starting the rust proxy first for hotel
        2025-04-04T13:59:00.091531Z  INFO proxy::hotel: Reading analysis data from /analysis.txt
        [run.sh] Running warmup test
        [run.sh] /wrk/wrk -t8 -c512 -d3s -L http://localhost:3000
        Running 3s test @ http://localhost:3000
        8 threads and 512 connections
        Thread Stats   Avg      Stdev     Max   +/- Stdev
        Latency   266.11ms   92.53ms 614.00ms   67.32%
        Req/Sec   207.74     77.52   383.00     72.08%
        Latency Distribution
        50%  264.51ms
        75%  327.79ms
        90%  384.13ms
        99%  501.05ms
        4969 requests in 3.02s, 378.50KB read
        Requests/sec:   1642.88
        Transfer/sec:    125.14KB
        [run.sh] Speed is 1642.88, duration is 18
        [run.sh] Fix the request number.
        [run.sh] Running the actual test
        [run.sh] /wrk/wrk --timeout 20s -t8 -c512 -d18s -s /wrk/fix_req_n.lua -L http://localhost:3000
        Running 18s test @ http://localhost:3000
        8 threads and 512 connections
        Thread Stats   Avg      Stdev     Max   +/- Stdev
        Latency   287.21ms  101.63ms 830.99ms   70.16%
        Req/Sec   220.96     56.26   380.00     67.59%
        Latency Distribution
        50%  283.61ms
        75%  350.75ms
        90%  417.04ms
        99%  557.34ms
        20000 requests in 18.00s, 1.49MB read
        Requests/sec:   1111.10
        Transfer/sec:     84.63KB
        ------------------------------
        stop time: 11.209138
        stop time: 11.258818
        stop time: 11.353867
        stop time: 11.407734
        stop time: 11.465398
        stop time: 11.443884
        stop time: 11.514552
        stop time: 11.346347
        [run.sh] Checking the resource usage
        NAME                             CPU(cores)   MEMORY(bytes)
        frontend-5d7fd9cd56-7gqg5        1614m        46Mi
        profile-85f6964f6c-4shg5         1054m        318Mi
        rate-5b9757cd6d-g6dxt            289m         157Mi
        reservation-7888856755-sszvl     325m         181Mi
        search-79d747946c-cwx5n          577m         78Mi
        ubuntu-client-76886f6bbd-zdqd4   805m         42Mi
        user-7bc55bfc7f-2c8sm            79m          9Mi
        [run.sh] Test finished with status 0
        > STDERR
        > No resources found in default namespace.
    [exp] Times: [11.209138, 11.258818, 11.353867, 11.407734, 11.465398, 11.443884, 11.514552, 11.346347]
    [exp] Throughput: 1758.2468204468898
[test.py] Running slowdown experiment
    [exp] Running (pre_run: False) workload hotel/mix request with the following configuration: {'CLIENT_CPU_QUOTA': '4', 'SLOWPOKE_POKER_BATCH_THRESHOLD': '40000000', 'SLOWPOKE_PROCESSING_MICROS_FRONTEND': '0', 'SLOWPOKE_PROCESSING_MICROS_PROFILE': '1000', 'SLOWPOKE_PROCESSING_MICROS_RATE': '0', 'SLOWPOKE_PROCESSING_MICROS_RESERVATION': '0', 'SLOWPOKE_PROCESSING_MICROS_SEARCH': '0', 'SLOWPOKE_PROCESSING_MICROS_USER': '0', 'SLOWPOKE_DELAY_MICROS_FRONTEND': '400.0', 'SLOWPOKE_DELAY_MICROS_PROFILE': '0.0', 'SLOWPOKE_DELAY_MICROS_RATE': '500.0', 'SLOWPOKE_DELAY_MICROS_RESERVATION': '400.0', 'SLOWPOKE_DELAY_MICROS_SEARCH': '500.0', 'SLOWPOKE_DELAY_MICROS_USER': '2015.0'}
    [exp] Executing cmd `bash run.sh hotel mix 8 512 20000`:
        [run.sh] Running benchmark hotel with request mix, thread 8, conn 512, duration 60
        [run.sh] Deleting all services
        service "frontend" deleted
        deployment.apps "frontend" deleted
        service "profile" deleted
        deployment.apps "profile" deleted
        service "rate" deleted
        deployment.apps "rate" deleted
        service "reservation" deleted
        deployment.apps "reservation" deleted
        service "search" deleted
        deployment.apps "search" deleted
        service "user" deleted
        deployment.apps "user" deleted
        deployment.apps "ubuntu-client" deleted
        [run.sh] Waiting for all pods to be deleted
        [run.sh] Deploying all services
        service/frontend created
        deployment.apps/frontend created
        service/profile created
        deployment.apps/profile created
        service/rate created
        deployment.apps/rate created
        service/reservation created
        deployment.apps/reservation created
        service/search created
        deployment.apps/search created
        service/user created
        deployment.apps/user created
        [run.sh] Client pod not found, deploying client
        deployment.apps/ubuntu-client created
        [run.sh] Waiting for all pods to be running
        [run.sh] All pods are running
        [run.sh] Checking heartbeat for all services
        [run.sh] All pods can connect to all services
        [run.sh] Copying hotel/analysis.txt to ubuntu-client-76886f6bbd-bk4kb:/analysis.txt
        [run.sh] Finished populating hotel
        [run.sh] Starting the rust proxy first for hotel
        2025-04-04T14:00:33.821642Z  INFO proxy::hotel: Reading analysis data from /analysis.txt
        [run.sh] Running warmup test
        [run.sh] /wrk/wrk -t8 -c512 -d3s -L http://localhost:3000
        Running 3s test @ http://localhost:3000
        8 threads and 512 connections
        Thread Stats   Avg      Stdev     Max   +/- Stdev
        Latency   421.81ms  159.32ms   1.00s    70.99%
        Req/Sec   128.59     48.69   272.00     68.38%
        Latency Distribution
        50%  411.42ms
        75%  512.89ms
        90%  619.70ms
        99%  873.21ms
        3027 requests in 3.02s, 230.57KB read
        Requests/sec:   1002.06
        Transfer/sec:     76.33KB
        [run.sh] Speed is 1002.06, duration is 29
        [run.sh] Fix the request number.
        [run.sh] Running the actual test
        [run.sh] /wrk/wrk --timeout 20s -t8 -c512 -d29s -s /wrk/fix_req_n.lua -L http://localhost:3000
        Running 29s test @ http://localhost:3000
        8 threads and 512 connections
        Thread Stats   Avg      Stdev     Max   +/- Stdev
        Latency   467.97ms  157.13ms   1.42s    70.15%
        Req/Sec   135.09     44.60   370.00     68.41%
        Latency Distribution
        50%  458.59ms
        75%  560.76ms
        90%  663.80ms
        99%  905.24ms
        20000 requests in 29.00s, 1.49MB read
        Requests/sec:    689.65
        Transfer/sec:     52.53KB
        ------------------------------
        stop time: 18.203396
        stop time: 18.386659
        stop time: 18.591152
        stop time: 18.775436
        stop time: 18.924421
        stop time: 18.681714
        stop time: 18.680837
        stop time: 18.996016
        [run.sh] Checking the resource usage
        NAME                        CPU(cores)   MEMORY(bytes)
        frontend-7fb6c965f6-sptbd   3m           2Mi
        [run.sh] Test finished with status 0
        > STDERR
        > No resources found in default namespace.
    [exp] Times: [18.203396, 18.386659, 18.591152, 18.775436, 18.924421, 18.681714, 18.680837, 18.996016]
    [exp] Throughput: 1072.1012838741206
    [exp] Running (pre_run: False) workload hotel/mix request with the following configuration: {'CLIENT_CPU_QUOTA': '4', 'SLOWPOKE_POKER_BATCH_THRESHOLD': '40000000', 'SLOWPOKE_PROCESSING_MICROS_FRONTEND': '0', 'SLOWPOKE_PROCESSING_MICROS_PROFILE': '1000', 'SLOWPOKE_PROCESSING_MICROS_RATE': '0', 'SLOWPOKE_PROCESSING_MICROS_RESERVATION': '0', 'SLOWPOKE_PROCESSING_MICROS_SEARCH': '0', 'SLOWPOKE_PROCESSING_MICROS_USER': '0', 'SLOWPOKE_DELAY_MICROS_FRONTEND': '200.0', 'SLOWPOKE_DELAY_MICROS_PROFILE': '0.0', 'SLOWPOKE_DELAY_MICROS_RATE': '250.0', 'SLOWPOKE_DELAY_MICROS_RESERVATION': '200.0', 'SLOWPOKE_DELAY_MICROS_SEARCH': '250.0', 'SLOWPOKE_DELAY_MICROS_USER': '1007.5'}
    [exp] Executing cmd `bash run.sh hotel mix 8 512 20000`:
        [run.sh] Running benchmark hotel with request mix, thread 8, conn 512, duration 60
        [run.sh] Deleting all services
        service "frontend" deleted
        deployment.apps "frontend" deleted
        service "profile" deleted
        deployment.apps "profile" deleted
        service "rate" deleted
        deployment.apps "rate" deleted
        service "reservation" deleted
        deployment.apps "reservation" deleted
        service "search" deleted
        deployment.apps "search" deleted
        service "user" deleted
        deployment.apps "user" deleted
        deployment.apps "ubuntu-client" deleted
        [run.sh] Waiting for all pods to be deleted
        [run.sh] Deploying all services
        service/frontend created
        deployment.apps/frontend created
        service/profile created
        deployment.apps/profile created
        service/rate created
        deployment.apps/rate created
        service/reservation created
        deployment.apps/reservation created
        service/search created
        deployment.apps/search created
        service/user created
        deployment.apps/user created
        [run.sh] Client pod not found, deploying client
        deployment.apps/ubuntu-client created
        [run.sh] Waiting for all pods to be running
        [run.sh] All pods are running
        [run.sh] Checking heartbeat for all services
        [run.sh] All pods can connect to all services
        [run.sh] Copying hotel/analysis.txt to ubuntu-client-76886f6bbd-s76zw:/analysis.txt
        [run.sh] Finished populating hotel
        [run.sh] Starting the rust proxy first for hotel
        2025-04-04T14:02:06.534510Z  INFO proxy::hotel: Reading analysis data from /analysis.txt
        [run.sh] Running warmup test
        [run.sh] /wrk/wrk -t8 -c512 -d3s -L http://localhost:3000
        Running 3s test @ http://localhost:3000
        8 threads and 512 connections
        Thread Stats   Avg      Stdev     Max   +/- Stdev
        Latency   343.05ms  138.41ms   1.05s    71.10%
        Req/Sec   164.33     61.74   340.00     65.80%
        Latency Distribution
        50%  324.19ms
        75%  419.18ms
        90%  529.23ms
        99%  744.68ms
        3814 requests in 3.04s, 290.52KB read
        Requests/sec:   1256.54
        Transfer/sec:     95.71KB
        [run.sh] Speed is 1256.54, duration is 23
        [run.sh] Fix the request number.
        [run.sh] Running the actual test
        [run.sh] /wrk/wrk --timeout 20s -t8 -c512 -d23s -s /wrk/fix_req_n.lua -L http://localhost:3000
        Running 23s test @ http://localhost:3000
        8 threads and 512 connections
        Thread Stats   Avg      Stdev     Max   +/- Stdev
        Latency   380.14ms  124.65ms 908.54ms   71.45%
        Req/Sec   167.41     59.11   330.00     69.93%
        Latency Distribution
        50%  381.62ms
        75%  456.13ms
        90%  539.40ms
        99%  705.28ms
        20000 requests in 23.00s, 1.49MB read
        Requests/sec:    869.56
        Transfer/sec:     66.24KB
        ------------------------------
        stop time: 14.984671
        stop time: 14.996792
        stop time: 15.108298
        stop time: 15.131809
        stop time: 14.955385
        stop time: 15.154755
        stop time: 15.103898
        stop time: 15.155573
        [run.sh] Checking the resource usage
        NAME                             CPU(cores)   MEMORY(bytes)
        frontend-6d576bb6b-cf6dk         1084m        53Mi
        profile-5856cd6487-d6jsh         889m         402Mi
        rate-7dcf4b4bff-9dff4            106m         165Mi
        reservation-59c5869f6f-bzwn7     131m         173Mi
        search-5c99c8cd76-599fp          184m         77Mi
        ubuntu-client-76886f6bbd-s76zw   485m         60Mi
        user-66475c447d-ghb4v            34m          10Mi
        [run.sh] Test finished with status 0
        > STDERR
        > No resources found in default namespace.
    [exp] Times: [14.984671, 14.996792, 15.108298, 15.131809, 14.955385, 15.154755, 15.103898, 15.155573]
    [exp] Throughput: 1326.796857557934
[test.py] Baseline throughput:  1764.3897452256492
[test.py] Groundtruth:  [1780.801618499359, 1758.2468204468898]
[test.py] Slowdown:  [1072.1012838741206, 1326.796857557934]
[test.py] Predicted:  [1877.061152458532, 1806.048843620225]
[test.py] Error percentage:  [5.40540467614179, 2.718732240402139]
[test.py] ++++++++++++++++++++++++++++++++ Summary: 
[test.py] Result for the experiment 0: 
    Baseline throughput: 1764.3897452256492
    Groundtruth: [1780.801618499359, 1758.2468204468898]
    Slowdown:    [1072.1012838741206, 1326.796857557934]
    Predicted:   [1877.061152458532, 1806.048843620225]
    Error Perc:  [5.40540467614179, 2.718732240402139]